vizualjack/bl602_rgb_controller/customer_app/custom_app/custom_app/main.c
	if(hal_boot2_get_active_entries(BOOT2_PARTITION_TYPE_FW, &ptEntry))
	{
		printf("PtTable_Get_Active_Entries fail\r\n");
		vPortFree(recv_buffer);
		bl_mtd_close(handle);
		// return http_rest_error(request, -20, "PtTable_Get_Active_Entries fail");
        puts("PtTable_Get_Active_Entries fail");
        return;
	}
	ota_addr = ptEntry.Address[!ptEntry.activeIndex];
	bin_size = ptEntry.maxLen[!ptEntry.activeIndex];
	// part_size = ptEntry.maxLen[!ptEntry.activeIndex];
	// (void)part_size;
	/*XXX if you use bin_size is product env, you may want to set bin_size to the actual
	 * OTA BIN size, and also you need to splilt XIP_SFlash_Erase_With_Lock into
	 * serveral pieces. Partition size vs bin_size check is also needed
	 */
	printf("Starting OTA test. OTA size is %lu\r\n", bin_size);

    if(file_size >= bin_size)
    {
        puts("BIN file is too big");
        return;
        // return http_rest_error(request, -20, "Too large bin");
    }

	printf("[OTA] [TEST] activeIndex is %u, use OTA address=%08x\r\n", ptEntry.activeIndex, (unsigned int)ota_addr);

	printf("[OTA] [TEST] Erase flash with size %lu...", bin_size);
	hal_update_mfg_ptable();

	//Erase in chunks, because erasing everything at once is slow and causes issues with http connection
	uint32_t erase_offset = 0;
	uint32_t erase_len = 0;
	while(erase_offset < bin_size)
	{
		erase_len = bin_size - erase_offset;
		if(erase_len > 0x10000)
		{
			erase_len = 0x10000; //Erase in 64kb chunks
		}
		bl_mtd_erase(handle, erase_offset, erase_len);
		printf("[OTA] Erased:  %lu / %lu \r\n", erase_offset, erase_len);
		erase_offset += erase_len;
		// rtos_delay_milliseconds(100);
	}
	printf("[OTA] Done\r\n");


// TODO: Edit write logic code
// grab data from http post request and write it to flash
	buffer_offset = 0;
	flash_offset = 0;
	do
	{
		char* useBuf = writebuf;
		int useLen = writelen;


		if(useLen)
		{
			
			//ADDLOG_DEBUG(LOG_FEATURE_OTA, "%d bytes to write", writelen);
			//add_otadata((unsigned char*)writebuf, writelen);

			printf("Flash takes %i. ", useLen);
			bl_mtd_write(handle, flash_offset, useLen, (u_int8_t*)useBuf);
			flash_offset += useLen;
		}

		total += writelen;
		towrite -= writelen;

	} while((towrite > 0) && (writelen >= 0));
// 
	printf("[OTA] [TCP] prepare OTA partition info\r\n");
	ptEntry.len = total;
	printf("[OTA] [TCP] Update PARTITION, partition len is %lu\r\n", ptEntry.len);
	hal_boot2_update_ptable(&ptEntry);
	puts("[OTA] [TCP] Rebooting\r\n");
	vPortFree(recv_buffer);
	bl_mtd_close(handle);
	return 0;
}

err_t handle_firmware_upload(struct netconn *conn, char *request_buf, u16_t request_len) {
    // http_rest_post_flash(request, -1, -1);

    // Initialize OTA
    // int ret = ota_init("ota_update");
    // if (ret != 0) {
    //     printf("[handle_firmware_upload] OTA initialization failed: %d\n", ret);
    //     return ERR_VAL;
    // }

    // // Extract the firmware binary from the HTTP POST body
    char *body = strstr(request_buf, "\r\n\r\n");
    if (!body) {
        puts("[handle_firmware_upload] HTTP body not found\n");
        // ota_deinit();
        return ERR_VAL;
    }

    body += 4;  // Skip over "\r\n\r\n" to the start of the firmware binary
    u16_t body_len = request_len - (body - request_buf);
    printf("[handle_firmware_upload] Body length: %i\n", body_len);
    // // Write the firmware to the OTA partition
    // ret = ota_write(body, body_len);
    // if (ret != 0) {
    //     printf("[handle_firmware_upload] OTA write failed: %d\n", ret);
    //     ota_deinit();
    //     return ERR_VAL;
    // }

    // printf("[handle_firmware_upload] Firmware uploaded: %d bytes\n", body_len);

    // // Finalize OTA
    // ret = ota_finalize();
    // if (ret != 0) {
    //     printf("[handle_firmware_upload] OTA finalize failed: %d\n", ret);
    //     ota_deinit();
    //     return ERR_VAL;
    // }

    // printf("[handle_firmware_upload] Firmware upload successful\n");

    // // Apply the new firmware and reboot
    // ota_apply();
    // bl_sys_reset();  // Reboot the device

    return ERR_OK;
}
#define MAX_BUFFER_SIZE 1024
// HTTP handler for the root page
err_t httpd_handler(struct netconn *conn) {
    struct netbuf *inbuf;
    char *buf;
    u16_t buflen;

    // Receive HTTP request
    if (netconn_recv(conn, &inbuf) == ERR_OK) {
        netbuf_data(inbuf, (void **)&buf, &buflen);
        
        printf("HTTP Length: %i\n", buflen);
        printf("HTTP Request: %s\n", buf);

        // Check if the request is a POST (for file upload)
        if (strncmp(buf, "POST /ota", 9) == 0) {
            puts("[httpd_handler] Handling firmware upload...\n");
            int content_length = 0;
            // Parse Content-Length header
            char *content_length_str = strstr(buf, "Content-Length:");
            if (content_length_str) {
                sscanf(content_length_str, "Content-Length: %d", &content_length);
                printf("Content-Length header found: %d\n", content_length);
            } else {
                puts("Content-Length header not found\n");
            }
            
            // Find the start of the body
            char *body_start = strstr(buf, "\r\n\r\n");
            if (body_start) {
                body_start += 4; // Skip past "\r\n\r\n"
                int body_length = buflen - (body_start - buf);
                printf("Body Start Found. Initial Body Length: %d\n", body_length);
                // If more data is expected, read it into a buffer
                if (body_length < content_length) {
                    int remaining = content_length - body_length;
                    char *post_data = malloc(content_length + 1);
                    memcpy(post_data, body_start, body_length);
                    netbuf_delete(inbuf);
                    while (remaining > 0) {
                        char chunk[MAX_BUFFER_SIZE];
                        int to_read = remaining > MAX_BUFFER_SIZE ? MAX_BUFFER_SIZE : remaining;
                        err_t recv_err = netconn_recv(conn, &inbuf);
                        if (recv_err == ERR_OK) {
                            netbuf_data(inbuf, (void **)&buf, &buflen);
                            memcpy(post_data + body_length, buf, buflen);
                            body_length += buflen;
                            remaining -= buflen;
                            netbuf_delete(inbuf);
                        } else {
                            printf("Error receiving additional data\n");
                            free(post_data);
                            netbuf_delete(inbuf);
                            return ERR_CLSD;
                        }
                    }
                    char *content_start = strstr(post_data, "\r\n\r\n");
                    content_start += 4; // Skip past "\r\n\r\n"
                    char *content_end = strstr(content_start, "\r\n------");
                    int content_size = content_end - content_start;
                    printf("Content length: %i\n", content_size);
                    char *content = malloc(content_size + 1);
                    memcpy(content, content_start, content_size);
                    free(post_data);
                    content[content_size] = '\0';
                    printf("Full POST Data Received: %s\n", content);
                } else {
                    printf("POST Body: %.*s\n", body_length, body_start);
                }
            } else {
                printf("Body Start not found in the request\n");
            }

            // Parse and handle the firmware data
            if (handle_firmware_upload(conn, buf, buflen) != ERR_OK) {
                const char *error_response =
                    "HTTP/1.1 500 Internal Server Error\r\n"
                    "Connection: close\r\n\r\n"
                    "Failed to process firmware upload.";
                netconn_write(conn, error_response, strlen(error_response), NETCONN_COPY);
            } else {
                const char *success_response =
                    "HTTP/1.1 200 OK\r\n"
                    "Connection: close\r\n\r\n"
                    "Firmware uploaded successfully.";
                netconn_write(conn, success_response, strlen(success_response), NETCONN_COPY);
            }
        } else {
            // Default response (serves an HTML page)
            const char *response =
                "HTTP/1.1 200 OK\r\n"
                "Content-Type: text/html\r\n"
                "Connection: close\r\n\r\n";
            netconn_write(conn, response, strlen(response), NETCONN_COPY);
            netconn_write(conn, html_page, strlen(html_page), NETCONN_COPY);
        }
    }

